Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal.AddVertices(System.Collections.Generic.IList{Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal})
Inserts multiple Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal instances into the stream and associated buffer.
vertices:
The vertices to be inserted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the associated buffer is not mapped.
-or-
Thrown if the associated buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal.AddVertex(Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal)
Inserts a Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal into the stream and associated buffer.
vertex:
The vertex to be inserted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the associated buffer is not mapped.
-or-
Thrown if the associated buffer has insufficient space.
Since:
2017